# Проект FitLife - MVP версия 1.0
# Приветствие и представление бота, для чего он нужен
print("""Привет! Меня зовут FitLife-бот.
"Я буду помогать тебе следить за твоим здоровьем!""")
# Узнаём имя пользователя
user_name = input(
    "Но прежде чем начать, я бы хотел узнать твоё имя... "
).strip()
# Если пользователь вводит пустую строку
while user_name == "":
    user_name = input(
        "Имя указано некорректно. Попробуй снова... "
    ).strip()
print("Приятно познакомиться", user_name, sep=", ", end="! ")
# Узнаём возраст польователя
user_age = int(input("Сколько тебе лет? "))
# Если пользовтелю слишком мало/много лет
while user_age < 18 or user_age > 70:
    user_age = int(input("Возраст указан некорректно. Попробуй снова... "))
# Подстраивание окончания год/года/лет под возраст
age_unit = 0  # переменная для год/года/лет
if user_age % 10 == 1:
    age_unit = "год"
elif user_age % 10 in range(2, 5):
    age_unit = "года"
else:
    age_unit = "лет"
print("Превосходно", user_name, "продолжаем", sep=", ", end="!")
print(" Теперь мы можем приступить к самому важному...")
# Узнаём вес
print("Чтобы я помог тебе с расчётами Индекса Массы Тела (ИМТ)")
print("и нормой воды, мне нужно узнать твой вес и рост.")
user_weight = float(input("Укажи свой вес (в килограммах) Например: 60.5 "))
# Если у пользователя слишком маленький/большой вес
while user_weight < 40.0 or user_weight > 100.0:
    user_weight = float(input("Вес указан некорректно. Попробуй снова... "))
# Узнаём рост
user_height = float(input("Укажи свой рост (в метрах). Например: 1.76 "))
# Если у пользователя слишком маленький/большой рост
while user_height < 1.45 or user_height > 2.0:
    user_height = float(input("Вес указан некорректно. Попробуй снова... "))
# Расчитываем ИМТ
bmi = round(user_weight / (user_height ** 2), 1)  # плюс округление ИМТ
# Расчитываем норму воду
WATER_PER_KG = 30   # константа для расчета нормы воды в мл
WATER_PER_LITRE = 1000   # перевод мл в л
water_ml = user_weight * WATER_PER_KG   # норма воды в мл
water_litre = round(water_ml / WATER_PER_LITRE, 1)  # норма воды в л/округление
# Отчет для пользователя
print(f"Отчёт для пользователя: {user_name}, {user_age} {age_unit}")
print(f"Твой Индекс Массы Тела: {bmi}.")
print(f"Рекомендуемая норма воды: {water_litre} л в день.")
# Прощание
print("Расчет окончен. Будьте здоровы!")
