# Проект FitLife - MVP версия 1.0
# Приветствие и представление бота, для чего он нужен
print('Привет! Меня зовут FitLife-бот.')
print('Я буду помогать тебе следить за твоим здоровьем!')
# Узнаём имя пользователя
user_name = input('Но прежде чем начать, я бы хотел узнать твоё имя... ')
print('Приятно познакомиться', user_name, sep=', ', end='!')
# Узнаём возраст польователя
user_age = int(input(' Сколько тебе лет? '))
print('Превосходно', user_name, 'продолжаем', sep=', ', end='!')
print(' Теперь мы можем приступить к самому важному...')
# Узнаём вес и рост
print('Чтобы я помог тебе с расчётами Индекса Массы Тела (ИМТ)')
print('и нормой воды, мне нужно узнать твой вес и рост.')
user_weight = float(input('Укажи свой вес (в килограммах) Например: 60.5 '))
user_height = float(input('Укажи свой рост (в метрах). Например: 1.76 '))
# Расчитываем ИМТ
bmi = user_weight / (user_height ** 2)
rounding_bmi = round(bmi, 1)   # округление ИМТ
# Расчитываем норму воду
WATER_PER_KG = 30   # константа для расчета нормы воды в мл
WATER_NORMAL_L = 1000   # константа для расчета нормы воды в л
water_ml = user_weight * WATER_PER_KG   # норма воды в мл
water_l = water_ml / WATER_NORMAL_L   # норма воды в л
rounding_water = round(water_l, 1)   # округление нормы воды в л
# Отчет для пользователя
print(f'Отчёт для пользователя: {user_name}, {user_age} г.')
print(f'Твой Индекс Массы Тела: {rounding_bmi}.')
print(f'Рекомендуемая норма воды: {rounding_water} л в день.')
# Прощание
print('Расчет окончен. Будьте здоровы!')
